Долома/src/InformationRegisters/ТаблицаПитательностиКормов/ТаблицаПитательностиКормов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТаблицаПитательностиКормов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СухоеВещество</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ОЭ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>NEL</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>XP</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>РастворимыйСП</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>РастворимыйВРубцеПротеин</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>НерастворимыйВРубцеПротеин</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>nXp</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>RNB</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>UDP</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СЗ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СЖ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СК</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>NDF</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ADF</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Структ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрКл</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ADL</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Крахмал</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ТранзитныйКрахмал</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Сахар</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Ca</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Na</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Mg</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>K</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Cl</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>S</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>P</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ПереваримоеОрганическоеВещество</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>НДКПпереваримость</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>УксуснаяКислота</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>МолочнаяКислота</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>pH</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Enums/ВидыКормов/ВидыКормов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКормов</name>
  <enumValues>
    <name>ОК</name>
    <comment>Основной корм</comment>
  </enumValues>
  <enumValues>
    <name>МК</name>
    <comment>Минеральный корм</comment>
  </enumValues>
  <enumValues>
    <name>КК</name>
    <comment>Концентрированный корм</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

Долома/src/CommonModules/РасчетРационов/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет автоматическую оптимизацию рациона кормления
//
// Параметры:
//  ДанныеРациона - Структура - данные рациона для оптимизации:
//   * Дата - Дата - дата рациона
//   * ГруппаЖивотных - СправочникСсылка.ГруппыЖивотных - группа животных
//   * ТаблицаКормов - ТаблицаЗначений - таблица кормов с диапазонами веса
//   * ТаблицаПоказателей - ТаблицаЗначений - нормативные показатели
//
// Возвращаемое значение:
//   Структура - результат оптимизации:
//    * Успех - Булево - признак успешного завершения
//    * ТаблицаКормов - ТаблицаЗначений - таблица с рассчитанными весами
//    * КоличествоПоказателейВнеНормы - Число - количество показателей вне нормы
//    * ОбщееКоличествоПоказателей - Число - общее количество показателей
//    * ВремяРасчета - Число - время расчета в секундах
//    * ТекстОшибки - Строка - текст ошибки при неуспехе
//
Функция ВыполнитьАвтоматическуюОптимизацию(ДанныеРациона) Экспорт
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МаксимальноеВремяРасчета = 30000; // 30 секунд в миллисекундах
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ТаблицаКормов", Неопределено);
	Результат.Вставить("КоличествоПоказателейВнеНормы", 0);
	Результат.Вставить("ОбщееКоличествоПоказателей", 0);
	Результат.Вставить("ВремяРасчета", 0);
	Результат.Вставить("ТекстОшибки", "");
	
	Попытка
		
		// Шаг 1: Подготовка входных данных
		ДанныеДляОптимизации = ПодготовитьДанныеДляОптимизации(ДанныеРациона);
		Если ДанныеДляОптимизации.ЕстьОшибка Тогда
			Результат.ТекстОшибки = ДанныеДляОптимизации.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;
		
		// Шаг 2: Выполнение оптимизации
		РезультатОптимизации = ВыполнитьОптимизациюПокоординатнымСпуском(
			ДанныеДляОптимизации, 
			ВремяНачала, 
			МаксимальноеВремяРасчета);
		
		// Шаг 3: Применение результата
		Если РезультатОптимизации.НайденоРешение Тогда
			
			// Обновление таблицы кормов с рассчитанными весами
			ТаблицаКормов = ДанныеРациона.ТаблицаКормов.Скопировать();
			Для Индекс = 0 По РезультатОптимизации.ВесаКормов.ВГраница() Цикл
				ТаблицаКормов[Индекс].Вес = РезультатОптимизации.ВесаКормов[Индекс];
			КонецЦикла;
			
			// Оценка качества решения
			ОценкаРешения = ОценитьРешение(РезультатОптимизации.ВесаКормов, ДанныеДляОптимизации);
			
			Результат.Успех = Истина;
			Результат.ТаблицаКормов = ТаблицаКормов;
			Результат.КоличествоПоказателейВнеНормы = ОценкаРешения.КоличествоПоказателейВнеНормы;
			Результат.ОбщееКоличествоПоказателей = ОценкаРешения.ОбщееКоличествоПоказателей;
			Результат.ВремяРасчета = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала) / 1000;
			
		Иначе
			Результат.ТекстОшибки = "Не удалось найти решение. Попробуйте изменить диапазоны веса кормов.";
		КонецЕсли;
		
	Исключение
		Результат.ТекстОшибки = СтрШаблон("Ошибка при выполнении оптимизации: %1", ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подготавливает данные для оптимизации
//
// Параметры:
//  ДанныеРациона - Структура - исходные данные рациона
//
// Возвращаемое значение:
//   Структура - подготовленные данные:
//    * ЕстьОшибка - Булево - признак ошибки
//    * ТекстОшибки - Строка - текст ошибки
//    * КоличествоКормов - Число - количество кормов
//    * МинимальныеВеса - Массив из Число - минимальные веса кормов
//    * МаксимальныеВеса - Массив из Число - максимальные веса кормов
//    * НачальныеВеса - Массив из Число - начальные веса (средние значения)
//    * МассивНоменклатуры - Массив - массив номенклатуры кормов
//    * МассивВидовКорма - Массив - массив видов кормов
//    * ТаблицаПитательности - ТаблицаЗначений - показатели питательности кормов
//    * МассивПоказателей - Массив - массив показателей для оптимизации
//    * СоответствиеПриоритетов - Соответствие - приоритеты показателей
//
Функция ПодготовитьДанныеДляОптимизации(ДанныеРациона)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибка", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("КоличествоКормов", 0);
	Результат.Вставить("МинимальныеВеса", Новый Массив);
	Результат.Вставить("МаксимальныеВеса", Новый Массив);
	Результат.Вставить("НачальныеВеса", Новый Массив);
	Результат.Вставить("МассивНоменклатуры", Новый Массив);
	Результат.Вставить("МассивВидовКорма", Новый Массив);
	Результат.Вставить("ТаблицаПитательности", Неопределено);
	Результат.Вставить("МассивПоказателей", Новый Массив);
	Результат.Вставить("СоответствиеПриоритетов", Новый Соответствие);
	
	ТаблицаКормов = ДанныеРациона.ТаблицаКормов;
	
	// Проверка наличия кормов
	Если ТаблицаКормов.Количество() = 0 Тогда
		Результат.ЕстьОшибка = Истина;
		Результат.ТекстОшибки = "Не указаны корма в рационе.";
		Возврат Результат;
	КонецЕсли;
	
	// Сбор данных по кормам
	Для каждого СтрокаКорма Из ТаблицаКормов Цикл
		Результат.МинимальныеВеса.Добавить(СтрокаКорма.МинимальныйВес);
		Результат.МаксимальныеВеса.Добавить(СтрокаКорма.МаксимальныйВес);
		// Начальное значение - среднее между мин и макс
		НачальныйВес = (СтрокаКорма.МинимальныйВес + СтрокаКорма.МаксимальныйВес) / 2;
		Результат.НачальныеВеса.Добавить(НачальныйВес);
		Результат.МассивНоменклатуры.Добавить(СтрокаКорма.Номенклатура);
		Результат.МассивВидовКорма.Добавить(СтрокаКорма.ВидКорма);
	КонецЦикла;
	
	Результат.КоличествоКормов = ТаблицаКормов.Количество();
	
	// Получение показателей питательности кормов
	Результат.ТаблицаПитательности = ПолучитьТаблицуПитательностиКормов(
		ДанныеРациона.Дата, 
		Результат.МассивНоменклатуры);
	
	// Проверка наличия данных по питательности
	Если Результат.ТаблицаПитательности.Количество() < Результат.КоличествоКормов Тогда
		Результат.ЕстьОшибка = Истина;
		Результат.ТекстОшибки = "Для некоторых кормов не заполнены показатели питательности.";
		Возврат Результат;
	КонецЕсли;
	
	// Подготовка показателей для оптимизации с приоритетами
	Результат.МассивПоказателей = ПодготовитьМассивПоказателей(ДанныеРациона.ТаблицаПоказателей);
	Результат.СоответствиеПриоритетов = ПолучитьСоответствиеПриоритетовПоказателей();
	
	// Проверка наличия нормативных показателей
	Если Результат.МассивПоказателей.Количество() = 0 Тогда
		Результат.ЕстьОшибка = Истина;
		Результат.ТекстОшибки = "Не заполнены нормативные показатели рациона.";
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает таблицу питательности кормов из регистра сведений
//
// Параметры:
//  Дата - Дата - дата среза
//  МассивНоменклатуры - Массив - массив номенклатуры кормов
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с показателями питательности
//
Функция ПолучитьТаблицуПитательностиКормов(Дата, МассивНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПитательности.Номенклатура КАК Номенклатура,
	|	ТаблицаПитательности.СухоеВещество КАК СухоеВещество,
	|	ТаблицаПитательности.ОЭ КАК ОЭ,
	|	ТаблицаПитательности.XP КАК XP,
	|	ТаблицаПитательности.nXp КАК nXp,
	|	ТаблицаПитательности.RNB КАК RNB,
	|	ТаблицаПитательности.СК КАК СК,
	|	ТаблицаПитательности.СЖ КАК СЖ,
	|	ТаблицаПитательности.СЗ КАК СЗ,
	|	ТаблицаПитательности.Крахмал КАК Крахмал,
	|	ТаблицаПитательности.ТранзитныйКрахмал КАК ТранзитныйКрахмал,
	|	ТаблицаПитательности.Сахар КАК Сахар,
	|	ТаблицаПитательности.NDF КАК NDF,
	|	ТаблицаПитательности.ADF КАК ADF,
	|	ТаблицаПитательности.NEL КАК NEL,
	|	ТаблицаПитательности.Ca КАК Ca,
	|	ТаблицаПитательности.Na КАК Na,
	|	ТаблицаПитательности.Mg КАК Mg,
	|	ТаблицаПитательности.K КАК K,
	|	ТаблицаПитательности.Cl КАК Cl,
	|	ТаблицаПитательности.S КАК S,
	|	ТаблицаПитательности.P КАК P,
	|	ТаблицаПитательности.Структ КАК Структ,
	|	ТаблицаПитательности.СтрКл КАК СтрКл,
	|	ТаблицаПитательности.РастворимыйСП КАК РастворимыйСП,
	|	ТаблицаПитательности.РастворимыйВРубцеПротеин КАК РастворимыйВРубцеПротеин,
	|	ТаблицаПитательности.НерастворимыйВРубцеПротеин КАК НерастворимыйВРубцеПротеин,
	|	ТаблицаПитательности.UDP КАК UDP,
	|	ТаблицаПитательности.ADL КАК ADL
	|ИЗ
	|	РегистрСведений.ТаблицаПитательностиКормов.СрезПоследних(&Дата, Номенклатура В (&МассивНоменклатуры)) КАК ТаблицаПитательности";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Подготавливает массив показателей для оптимизации
//
// Параметры:
//  ТаблицаПоказателей - ТаблицаЗначений - таблица нормативных показателей
//
// Возвращаемое значение:
//   Массив из Структура - массив показателей с параметрами
//
Функция ПодготовитьМассивПоказателей(ТаблицаПоказателей)
	
	МассивПоказателей = Новый Массив;
	
	Для каждого СтрокаПоказателя Из ТаблицаПоказателей Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаПоказателя.ПоказательРациона) Тогда
			Продолжить;
		КонецЕсли;
		
		Показатель = Новый Структура;
		Показатель.Вставить("ПоказательРациона", СтрокаПоказателя.ПоказательРациона);
		Показатель.Вставить("ИмяПредопределенныхДанных", СтрокаПоказателя.ПоказательРациона.ИмяПредопределенныхДанных);
		Показатель.Вставить("ЕдиницаИзмерения", СтрокаПоказателя.ЕдиницаИзмерения);
		Показатель.Вставить("Минимум", СтрокаПоказателя.Минимум);
		Показатель.Вставить("Максимум", СтрокаПоказателя.Максимум);
		
		// Применяем погрешность -5% к нижней границе
		Если ЗначениеЗаполнено(Показатель.Минимум) Тогда
			Показатель.Вставить("МинимумСПогрешностью", Показатель.Минимум * 0.95);
		Иначе
			Показатель.Вставить("МинимумСПогрешностью", 0);
		КонецЕсли;
		
		// Расчет оптимального значения (среднее между минимумом и максимумом)
		Если ЗначениеЗаполнено(Показатель.Минимум) И ЗначениеЗаполнено(Показатель.Максимум) Тогда
			Показатель.Вставить("Оптимум", (Показатель.Минимум + Показатель.Максимум) / 2);
			// Признак жёсткого ограничения (когда мин = макс)
			Показатель.Вставить("ЖесткоеОграничение", Показатель.Минимум = Показатель.Максимум);
		ИначеЕсли ЗначениеЗаполнено(Показатель.Минимум) Тогда
			Показатель.Вставить("Оптимум", Показатель.Минимум);
			Показатель.Вставить("ЖесткоеОграничение", Истина);
		ИначеЕсли ЗначениеЗаполнено(Показатель.Максимум) Тогда
			Показатель.Вставить("Оптимум", Показатель.Максимум);
			Показатель.Вставить("ЖесткоеОграничение", Истина);
		Иначе
			Показатель.Вставить("Оптимум", 0);
			Показатель.Вставить("ЖесткоеОграничение", Ложь);
		КонецЕсли;
		
		МассивПоказателей.Добавить(Показатель);
		
	КонецЦикла;
	
	Возврат МассивПоказателей;
	
КонецФункции

// Возвращает соответствие приоритетов показателей
//
// Возвращаемое значение:
//   Соответствие - соответствие имени показателя и его приоритета (меньше - выше)
//
Функция ПолучитьСоответствиеПриоритетовПоказателей()
	
	Приоритеты = Новый Соответствие;
	
	// Приоритет показателей согласно брифу
	Приоритеты.Вставить("СухоеВещество", 1); // Наивысший приоритет
	Приоритеты.Вставить("XP", 2); // СП (сырой протеин)
	Приоритеты.Вставить("СВВОК", 3); // СВ в ОК
	Приоритеты.Вставить("Влажность", 4);
	
	// Остальные показатели имеют низкий приоритет
	// (по умолчанию будет использоваться значение 99)
	
	Возврат Приоритеты;
	
КонецФункции

// Выполняет оптимизацию методом покоординатного спуска
//
// Параметры:
//  ДанныеДляОптимизации - Структура - подготовленные данные
//  ВремяНачала - Число - время начала в миллисекундах
//  МаксимальноеВремяРасчета - Число - максимальное время в миллисекундах
//
// Возвращаемое значение:
//   Структура - результат оптимизации:
//    * НайденоРешение - Булево - признак найденного решения
//    * ВесаКормов - Массив из Число - оптимальные веса кормов
//
Функция ВыполнитьОптимизациюПокоординатнымСпуском(ДанныеДляОптимизации, ВремяНачала, МаксимальноеВремяРасчета)
	
	Результат = Новый Структура;
	Результат.Вставить("НайденоРешение", Ложь);
	Результат.Вставить("ВесаКормов", Новый Массив);
	
	// Инициализация весов средними значениями
	ТекущиеВеса = Новый Массив;
	Для каждого Вес Из ДанныеДляОптимизации.НачальныеВеса Цикл
		ТекущиеВеса.Добавить(Вес);
	КонецЦикла;
	
	ЛучшиеВеса = СкопироватьМассив(ТекущиеВеса);
	ЛучшаяОценка = ВычислитьЦелевуюФункцию(ТекущиеВеса, ДанныеДляОптимизации);
	
	// Параметры оптимизации
	МаксимальноеКоличествоИтераций = 300; // Увеличено для лучшей сходимости
	ШагИзменения = 0.2; // 200 грамм - начинаем с более крупного шага
	МинимальныйШаг = 0.005; // 5 грамм - минимальная точность
	
	// Итерационная оптимизация
	Счетчик = 0;
	КоличествоИтерацийБезУлучшения = 0;
	
	Пока Счетчик < МаксимальноеКоличествоИтераций Цикл
		Счетчик = Счетчик + 1;
		
		// Проверка таймаута
		Если ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала > МаксимальноеВремяРасчета Тогда
			Прервать;
		КонецЕсли;
		
		БылоУлучшение = Ложь;
		
		// Оптимизация веса каждого корма
		// Целевая функция учитывает все показатели с приоритетами одновременно
		Для ИндексКорма = 0 По ДанныеДляОптимизации.КоличествоКормов - 1 Цикл
			
			// Проверка таймаута
			Если ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала > МаксимальноеВремяРасчета Тогда
				Прервать;
			КонецЕсли;
			
			МинВес = ДанныеДляОптимизации.МинимальныеВеса[ИндексКорма];
			МаксВес = ДанныеДляОптимизации.МаксимальныеВеса[ИндексКорма];
			ТекущийВес = ТекущиеВеса[ИндексКорма];
			
			// Пробуем разные шаги для более агрессивного поиска
			МассивШагов = Новый Массив;
			МассивШагов.Добавить(ШагИзменения);
			МассивШагов.Добавить(ШагИзменения * 2); // Удвоенный шаг для более быстрого движения
			МассивШагов.Добавить(ШагИзменения * 0.5); // Половинный шаг для точной настройки
			
			Для каждого ТекущийШаг Из МассивШагов Цикл
				
				// Пробуем изменить вес в обе стороны
				НаправленияИзменения = Новый Массив;
				НаправленияИзменения.Добавить(1); // Увеличение
				НаправленияИзменения.Добавить(-1); // Уменьшение
				
				Для каждого Направление Из НаправленияИзменения Цикл
					
					НовыйВес = ТекущийВес + Направление * ТекущийШаг;
					
					// Проверка границ
					Если НовыйВес < МинВес ИЛИ НовыйВес > МаксВес Тогда
						Продолжить;
					КонецЕсли;
					
					// Применяем новый вес
					НовыеВеса = СкопироватьМассив(ТекущиеВеса);
					НовыеВеса[ИндексКорма] = НовыйВес;
					
					// Оцениваем новое решение
					НоваяОценка = ВычислитьЦелевуюФункцию(НовыеВеса, ДанныеДляОптимизации);
					
					// Если решение лучше, принимаем его
					Если НоваяОценка < ЛучшаяОценка Тогда
						ТекущиеВеса = НовыеВеса;
						ЛучшиеВеса = СкопироватьМассив(ТекущиеВеса);
						ЛучшаяОценка = НоваяОценка;
						БылоУлучшение = Истина;
						КоличествоИтерацийБезУлучшения = 0;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		// Если не было улучшения, уменьшаем шаг
		Если НЕ БылоУлучшение Тогда
			КоличествоИтерацийБезУлучшения = КоличествоИтерацийБезУлучшения + 1;
			
			// Уменьшаем шаг постепенно
			Если КоличествоИтерацийБезУлучшения >= 3 Тогда
				ШагИзменения = ШагИзменения / 2;
				КоличествоИтерацийБезУлучшения = 0;
				
				Если ШагИзменения < МинимальныйШаг Тогда
					Прервать; // Достигнута минимальная точность
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.НайденоРешение = Истина;
	Результат.ВесаКормов = ЛучшиеВеса;
	
	Возврат Результат;
	
КонецФункции

// Вычисляет целевую функцию (взвешенную сумму отклонений от оптимума)
//
// Параметры:
//  ВесаКормов - Массив из Число - веса кормов
//  ДанныеДляОптимизации - Структура - данные для оптимизации
//
// Возвращаемое значение:
//   Число - значение целевой функции (меньше - лучше)
//
Функция ВычислитьЦелевуюФункцию(ВесаКормов, ДанныеДляОптимизации)
	
	// Рассчитываем показатели питательности для текущих весов
	ПоказателиПитательности = РассчитатьПоказателиПитательности(ВесаКормов, ДанныеДляОптимизации);
	
	// Вычисляем отклонения от оптимума с учетом приоритетов
	СуммаОтклонений = 0;
	
	Для каждого Показатель Из ДанныеДляОптимизации.МассивПоказателей Цикл
		
		ИмяПоказателя = Показатель.ИмяПредопределенныхДанных;
		ФактическоеЗначение = ПоказателиПитательности[ИмяПоказателя];
		
		// Вычисляем отклонение
		Отклонение = 0;
		
		// Для жёстких ограничений (мин = макс) - огромный штраф за любое отклонение
		Если Показатель.ЖесткоеОграничение Тогда
			
			Если Показатель.Оптимум > 0 Тогда
				// Относительное отклонение от точного значения
				РазницаСОптимумом = ФактическоеЗначение - Показатель.Оптимум;
				Если РазницаСОптимумом < 0 Тогда
					РазницаСОптимумом = -РазницаСОптимумом;
				КонецЕсли;
				// ОГРОМНЫЙ штраф за отклонение от жёсткого ограничения
				Отклонение = РазницаСОптимумом / Показатель.Оптимум * 10000;
			КонецЕсли;
			
		Иначе
			
			// Для диапазонов - стремление к оптимуму + штраф за выход за границы
			ОтклонениеОтОптимума = 0;
			Если Показатель.Оптимум > 0 Тогда
				// Относительное отклонение от оптимума (в процентах)
				РазницаСОптимумом = ФактическоеЗначение - Показатель.Оптимум;
				Если РазницаСОптимумом < 0 Тогда
					РазницаСОптимумом = -РазницаСОптимумом;
				КонецЕсли;
				ОтклонениеОтОптимума = РазницаСОптимумом / Показатель.Оптимум * 100;
			КонецЕсли;
			
			// Дополнительный штраф за выход за границы диапазона
			ШтрафЗаВыходЗаГраницы = 0;
			
			Если ЗначениеЗаполнено(Показатель.Минимум) И ФактическоеЗначение < Показатель.МинимумСПогрешностью Тогда
				// Ниже минимума с учетом погрешности - большой штраф
				Если Показатель.Минимум > 0 Тогда
					ШтрафЗаВыходЗаГраницы = (Показатель.МинимумСПогрешностью - ФактическоеЗначение) / Показатель.Минимум * 5000;
				Иначе
					ШтрафЗаВыходЗаГраницы = (Показатель.МинимумСПогрешностью - ФактическоеЗначение) * 500;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Показатель.Максимум) И ФактическоеЗначение > Показатель.Максимум Тогда
				// Выше максимума - большой штраф
				Если Показатель.Максимум > 0 Тогда
					ШтрафЗаВыходЗаГраницы = (ФактическоеЗначение - Показатель.Максимум) / Показатель.Максимум * 5000;
				Иначе
					ШтрафЗаВыходЗаГраницы = (ФактическоеЗначение - Показатель.Максимум) * 500;
				КонецЕсли;
			КонецЕсли;
			
			// Общее отклонение = отклонение от оптимума + штраф за выход за границы
			Отклонение = ОтклонениеОтОптимума + ШтрафЗаВыходЗаГраницы;
			
		КонецЕсли;
		
		// Дополнительный множитель для критичных показателей
		// Сухое вещество - критически важный показатель, штраф увеличен в 10 раз
		Если ИмяПоказателя = "СухоеВещество" Тогда
			Отклонение = Отклонение * 10;
		КонецЕсли;
		
		// Получаем приоритет показателя
		Приоритет = ДанныеДляОптимизации.СоответствиеПриоритетов[ИмяПоказателя];
		Если Приоритет = Неопределено Тогда
			Приоритет = 99; // Низкий приоритет по умолчанию
		КонецЕсли;
		
		// Коэффициент приоритета (чем выше приоритет, тем больше штраф)
		КоэффициентПриоритета = 100 / Приоритет;
		
		// Добавляем взвешенное отклонение
		СуммаОтклонений = СуммаОтклонений + Отклонение * КоэффициентПриоритета;
		
	КонецЦикла;
	
	Возврат СуммаОтклонений;
	
КонецФункции

// Рассчитывает показатели питательности для заданных весов кормов
//
// Параметры:
//  ВесаКормов - Массив из Число - веса кормов
//  ДанныеДляОптимизации - Структура - данные для оптимизации
//
// Возвращаемое значение:
//   Структура - рассчитанные показатели питательности
//
Функция РассчитатьПоказателиПитательности(ВесаКормов, ДанныеДляОптимизации)
	
	Показатели = Новый Структура;
	
	// Общий вес рациона в граммах
	ОбщийВес = 0;
	Для каждого Вес Из ВесаКормов Цикл
		ОбщийВес = ОбщийВес + Вес * 1000;
	КонецЦикла;
	
	// Инициализация показателей
	СуммаСВ = 0;
	СуммаСВ_ОК = 0;
	СуммаСВ_МК = 0;
	СуммаСВ_КК = 0;
	СуммаСВ_Прочее = 0;
	
	// Таблица для хранения сумм по показателям (аналог ТаблицаПоказателей в оригинале)
	СуммыПоказателей = Новый Соответствие;
	
	// Инициализация сумм для всех показателей
	Для каждого Показатель Из ДанныеДляОптимизации.МассивПоказателей Цикл
		СуммыПоказателей.Вставить(Показатель.ИмяПредопределенныхДанных, 0);
	КонецЦикла;
	
	// Двухпроходная обработка как в оригинале (сначала НЕ СухоеВещество, потом СухоеВещество)
	Для Сч = 1 По 2 Цикл
		
		Для каждого Показатель Из ДанныеДляОптимизации.МассивПоказателей Цикл
			
			ИмяПоказателя = Показатель.ИмяПредопределенныхДанных;
			
			// Первый проход - все кроме СухоеВещество, второй проход - только СухоеВещество
			Если (Сч = 1 И ИмяПоказателя <> "СухоеВещество") ИЛИ (Сч = 2 И ИмяПоказателя = "СухоеВещество") Тогда
				Продолжить;
			КонецЕсли;
			
			// Определяем имя колонки в таблице питательности
			Если ИмяПоказателя = "NDF_ОК" Тогда
				ИмяКолонкиПитательности = "NDF";
			Иначе	
				ИмяКолонкиПитательности = ИмяПоказателя;
			КонецЕсли;
			
			// Проверяем наличие колонки в таблице питательности
			Если ДанныеДляОптимизации.ТаблицаПитательности.Колонки.Найти(ИмяКолонкиПитательности) <> Неопределено Тогда
				
				СуммаПоказателя = 0;
				
				// Расчет показателя по всем кормам
				Для Индекс = 0 По ДанныеДляОптимизации.КоличествоКормов - 1 Цикл
					
					Номенклатура = ДанныеДляОптимизации.МассивНоменклатуры[Индекс];
					ВидКорма = ДанныеДляОптимизации.МассивВидовКорма[Индекс];
					Вес = ВесаКормов[Индекс];
					
					// Находим питательность корма
					СтрокаПитательности = ДанныеДляОптимизации.ТаблицаПитательности.Найти(Номенклатура, "Номенклатура");
					Если СтрокаПитательности = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					// Пропускаем нулевые значения (кроме показателей "ВРубце")
					Если СтрокаПитательности[ИмяКолонкиПитательности] <> 0 ИЛИ СтрНайти(ИмяКолонкиПитательности, "ВРубце") > 0 Тогда
						
						// Для NDF_ОК учитываем только основные корма
						Если ИмяПоказателя = "NDF_ОК" И ВидКорма <> Перечисления.ВидыКормов.ОК Тогда
							Продолжить;
						КонецЕсли;
						
						// Расчет значения питательности в зависимости от показателя
						Если ИмяКолонкиПитательности = "СухоеВещество" Тогда 
							// СухоеВещество берется напрямую
							ЗначениеПитательности = СтрокаПитательности[ИмяКолонкиПитательности];
						ИначеЕсли ИмяКолонкиПитательности = "РастворимыйСП" ИЛИ ИмяКолонкиПитательности = "РастворимыйВРубцеПротеин" Тогда
							// Формула: XP * РастворимыйСП / 100 * СухоеВещество / 1000
							ЗначениеПитательности = СтрокаПитательности.XP * СтрокаПитательности.РастворимыйСП / 100 * СтрокаПитательности.СухоеВещество / 1000;
						ИначеЕсли ИмяКолонкиПитательности = "НерастворимыйВРубцеПротеин" Тогда
							// Формула: XP * (100 - РастворимыйСП) / 100 * СухоеВещество / 1000
							ЗначениеПитательности = СтрокаПитательности.XP * (100 - СтрокаПитательности.РастворимыйСП) / 100 * СтрокаПитательности.СухоеВещество / 1000;
						Иначе	
							// Остальные показатели: значение * СухоеВещество / 1000
							ЗначениеПитательности = СтрокаПитательности[ИмяКолонкиПитательности] * СтрокаПитательности.СухоеВещество / 1000;			
						КонецЕсли;
						
						ТекЗначение = Вес * ЗначениеПитательности;
						СуммаПоказателя = СуммаПоказателя + ТекЗначение;
						
						// Накопление сухого вещества по видам корма
						Если ИмяПоказателя = "СухоеВещество" Тогда
							СуммаСВ = СуммаПоказателя;
							
							Если ВидКорма = Перечисления.ВидыКормов.ОК Тогда
								СуммаСВ_ОК = СуммаСВ_ОК + ТекЗначение;
							ИначеЕсли ВидКорма = Перечисления.ВидыКормов.МК Тогда
								СуммаСВ_МК = СуммаСВ_МК + ТекЗначение;
							ИначеЕсли ВидКорма = Перечисления.ВидыКормов.КК Тогда
								СуммаСВ_КК = СуммаСВ_КК + ТекЗначение;
							Иначе
								СуммаСВ_Прочее = СуммаСВ_Прочее + ТекЗначение;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				// Сохраняем сумму показателя
				СуммыПоказателей[ИмяПоказателя] = СуммаПоказателя;
				
			Иначе
				
				// Показатели, которых нет в таблице питательности, рассчитываются особым образом
				Если ИмяПоказателя = "СВВОК" Тогда
					СуммыПоказателей[ИмяПоказателя] = СуммаСВ_ОК;
				ИначеЕсли ИмяПоказателя = "Влажность" Тогда
					СуммыПоказателей[ИмяПоказателя] = ОбщийВес - СуммаСВ;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Постобработка показателей (расчет производных значений и перевод в проценты)
	Для каждого Показатель Из ДанныеДляОптимизации.МассивПоказателей Цикл
		
		ИмяПоказателя = Показатель.ИмяПредопределенныхДанных;
		
		// Обработка показателей НЕ в процентах
		Если Показатель.ЕдиницаИзмерения <> Справочники.ЕдиницыИзмерения.Процент Тогда
			
			Если ИмяПоказателя = "NELНаКгСВ" Тогда
				// NEL на кг СВ = 1000 * NEL / СуммаСВ
				Если СуммыПоказателей["NEL"] <> Неопределено И СуммаСВ > 0 Тогда
					СуммыПоказателей[ИмяПоказателя] = 1000 * СуммыПоказателей["NEL"] / СуммаСВ;
				КонецЕсли;
				
			ИначеЕсли ИмяПоказателя = "DCAD" Тогда
				// DCAD = 100 * (Na*434 + K*256 - Cl*282 - S*624) / (СуммаСВ - СуммаСВ_МК)
				СодержаниеNa = ПолучитьЗначениеПоказателя(СуммыПоказателей, "Na") * 434;
				СодержаниеK = ПолучитьЗначениеПоказателя(СуммыПоказателей, "K") * 256;
				СодержаниеCl = ПолучитьЗначениеПоказателя(СуммыПоказателей, "Cl") * 282;
				СодержаниеS = ПолучитьЗначениеПоказателя(СуммыПоказателей, "S") * 624;
				
				Если (СуммаСВ - СуммаСВ_МК) > 0 Тогда
					СуммыПоказателей[ИмяПоказателя] = 100 * (СодержаниеNa + СодержаниеK - СодержаниеCl - СодержаниеS) / (СуммаСВ - СуммаСВ_МК);
				КонецЕсли;
				
			ИначеЕсли ИмяПоказателя = "Ca_P" Тогда
				// Соотношение Ca к P
				СодержаниеCa = ПолучитьЗначениеПоказателя(СуммыПоказателей, "Ca");
				СодержаниеP = ПолучитьЗначениеПоказателя(СуммыПоказателей, "P");
				
				Если СодержаниеP > 0 Тогда
					СуммыПоказателей[ИмяПоказателя] = СодержаниеCa / СодержаниеP;
				КонецЕсли;
			КонецЕсли;
			
		// Обработка показателей в процентах
		ИначеЕсли Показатель.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.Процент Тогда
			
			Если ИмяПоказателя = "СВВОК" Тогда
				// СВВОК в процентах = 100 * СуммаСВ_ОК / СуммаСВ
				Если СуммаСВ > 0 Тогда
					СуммыПоказателей[ИмяПоказателя] = 100 * СуммаСВ_ОК / СуммаСВ;
				КонецЕсли;
				
			ИначеЕсли ИмяПоказателя = "Влажность" Тогда
				// Влажность в процентах = 100 - 100 * СуммаСВ / ОбщийВес
				Если ОбщийВес > 0 Тогда
					СуммыПоказателей[ИмяПоказателя] = 100 - 100 * СуммаСВ / ОбщийВес;
				КонецЕсли;
				
			ИначеЕсли ИмяПоказателя = "РастворимыйСП" Тогда
				// РастворимыйСП в процентах = 100 * РастворимыйСП / XP
				РастворимыйСП = ПолучитьЗначениеПоказателя(СуммыПоказателей, "РастворимыйСП");
				XP = ПолучитьЗначениеПоказателя(СуммыПоказателей, "XP");
				
				Если XP > 0 Тогда
					СуммыПоказателей[ИмяПоказателя] = 100 * РастворимыйСП / XP;
				КонецЕсли;
				
			Иначе
				// Остальные показатели в процентах = 100 * Показатель / СуммаСВ
				Если СуммыПоказателей[ИмяПоказателя] <> Неопределено И СуммаСВ > 0 Тогда
					БазовоеЗначение = СуммыПоказателей[ИмяПоказателя];
					СуммыПоказателей[ИмяПоказателя] = 100 * БазовоеЗначение / СуммаСВ;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Формируем результирующую структуру показателей
	Для каждого КлючЗначение Из СуммыПоказателей Цикл
		Показатели.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	// Добавляем базовые показатели
	Показатели.Вставить("СухоеВещество", СуммаСВ);
	
	Возврат Показатели;
	
КонецФункции

// Получает значение показателя из соответствия с проверкой
//
// Параметры:
//  СуммыПоказателей - Соответствие - соответствие показателей
//  ИмяПоказателя - Строка - имя показателя
//
// Возвращаемое значение:
//   Число - значение показателя или 0
//
Функция ПолучитьЗначениеПоказателя(СуммыПоказателей, ИмяПоказателя)
	
	Значение = СуммыПоказателей[ИмяПоказателя];
	Если Значение = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Оценивает качество найденного решения
//
// Параметры:
//  ВесаКормов - Массив из Число - веса кормов
//  ДанныеДляОптимизации - Структура - данные для оптимизации
//
// Возвращаемое значение:
//   Структура - оценка решения:
//    * КоличествоПоказателейВнеНормы - Число - количество показателей вне нормы
//    * ОбщееКоличествоПоказателей - Число - общее количество показателей
//
Функция ОценитьРешение(ВесаКормов, ДанныеДляОптимизации)
	
	Результат = Новый Структура;
	Результат.Вставить("КоличествоПоказателейВнеНормы", 0);
	Результат.Вставить("ОбщееКоличествоПоказателей", 0);
	
	// Рассчитываем показатели питательности
	ПоказателиПитательности = РассчитатьПоказателиПитательности(ВесаКормов, ДанныеДляОптимизации);
	
	// Проверяем каждый показатель
	Для каждого Показатель Из ДанныеДляОптимизации.МассивПоказателей Цикл
		
		Результат.ОбщееКоличествоПоказателей = Результат.ОбщееКоличествоПоказателей + 1;
		
		ИмяПоказателя = Показатель.ИмяПредопределенныхДанных;
		ФактическоеЗначение = ПоказателиПитательности[ИмяПоказателя];
		
		ВнеНормы = Ложь;
		
		Если ЗначениеЗаполнено(Показатель.Минимум) И ФактическоеЗначение < Показатель.МинимумСПогрешностью Тогда
			ВнеНормы = Истина;
		ИначеЕсли ЗначениеЗаполнено(Показатель.Максимум) И ФактическоеЗначение > Показатель.Максимум Тогда
			ВнеНормы = Истина;
		КонецЕсли;
		
		Если ВнеНормы Тогда
			Результат.КоличествоПоказателейВнеНормы = Результат.КоличествоПоказателейВнеНормы + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Сортирует показатели по приоритету
//
// Параметры:
//  МассивПоказателей - Массив - массив показателей
//  СоответствиеПриоритетов - Соответствие - приоритеты показателей
//
// Возвращаемое значение:
//   Массив - отсортированный массив показателей
//
Функция СортироватьПоказателиПоПриоритету(МассивПоказателей, СоответствиеПриоритетов)
	
	// Создаем таблицу для сортировки
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("Показатель");
	ТаблицаСортировки.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	
	Для каждого Показатель Из МассивПоказателей Цикл
		НоваяСтрока = ТаблицаСортировки.Добавить();
		НоваяСтрока.Показатель = Показатель;
		
		Приоритет = СоответствиеПриоритетов[Показатель.ИмяПредопределенныхДанных];
		Если Приоритет = Неопределено Тогда
			Приоритет = 99;
		КонецЕсли;
		
		НоваяСтрока.Приоритет = Приоритет;
	КонецЦикла;
	
	ТаблицаСортировки.Сортировать("Приоритет");
	
	РезультатМассив = Новый Массив;
	Для каждого Строка Из ТаблицаСортировки Цикл
		РезультатМассив.Добавить(Строка.Показатель);
	КонецЦикла;
	
	Возврат РезультатМассив;
	
КонецФункции

// Копирует массив
//
// Параметры:
//  ИсходныйМассив - Массив - исходный массив
//
// Возвращаемое значение:
//   Массив - копия массива
//
Функция СкопироватьМассив(ИсходныйМассив)
	
	НовыйМассив = Новый Массив;
	Для каждого Элемент Из ИсходныйМассив Цикл
		НовыйМассив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат НовыйМассив;
	
КонецФункции

#КонецОбласти
